Enterprise_Serivces/Prod/Bronze2/CSLDigitalContentService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/digitalcontent/contracts/2010/08/IDigitalContentService/GetFreeDlcCodesForProducts</wsa:Action><wsa:MessageID>uuid:1028dc1e-bd75-4192-b8a1-994eaafc7d1d</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://csldigitalcontentserviceqa1.testgs.pvt/DigitalContentService.svc</wsa:To></soap:Header><soap:Body><GetFreeDlcCodesForProducts xmlns="http://www.gamestop.com/services/csl/digitalcontent/contracts/2010/08"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CampaignProducts xmlns="http://www.gamestop.com/services/csl/digitalcontent/allspark/messages/contracts/messages/2010/05"><CampaignProduct><PickupType>DeliverOnPickup</PickupType><ProductID>1</ProductID></CampaignProduct></CampaignProducts><CustomerID xmlns="http://www.gamestop.com/services/csl/digitalcontent/allspark/messages/contracts/messages/2010/05">1131768783</CustomerID></request></GetFreeDlcCodesForProducts></soap:Body></soap:Envelope>